{
  "categories": [
    {
      "id": "necessary",
      "title": "Necessary Cookies",
      "description": "These cookies are essential for the website to function properly. They enable basic functionalities like page navigation and access to secure areas of the website. As they are required for the operation of the site, they do not require your consent and cannot be turned off.",
      "isMandatory": true,
      "cookies": [
        {
          "key": "cookie_consent_preferences",
          "description": "This cookie stores your cookie preferences for this website, ensuring that only your chosen cookie settings are applied during your visit and for future visits. It remains on your device for 30 days before it needs to be renewed.",
          "location": "Cookie",
          "duration": "30 days"
        }
      ]
    },
    {
      "id": "functional",
      "title": "Functional Cookies",
      "description": "Functional cookies allow the website to provide enhanced functionality and personalization. They may be set by me or by third-party providers whose services I have added to my pages. If you do not allow these cookies, some or all of these services may not function properly.",
      "isMandatory": false,
      "cookies": [
        {
          "key": "language",
          "description": "This cookie remembers your language preference on the website, allowing the site to present content in your preferred language during your current session.",
          "location": "SessionStorage",
          "duration": "session"
        },
        {
          "key": "theme",
          "description": "This cookie saves your theme preferences, such as dark or light mode, enhancing your visual experience on the website. Your selected theme will be remembered until you decide to change it.",
          "location": "LocalStorage",
          "duration": "until revocation"
        },
        {
          "key": "cv",
          "description": "This cookie is set after you successfully solve a CAPTCHA challenge, helping to protect the website against spam and abuse by automated software. It is stored for the duration of your session.",
          "location": "SessionStorage",
          "duration": "session"
        }
      ]
    },
    {
      "id": "analytics",
      "title": "Analytics Cookies",
      "description": "Analytics cookies help me understand how visitors interact with the website by collecting and reporting information anonymously. This data helps me improve the website and your browsing experience. These cookies will only be set with your consent.",
      "isMandatory": false,
      "cookies": []
    },
    {
      "id": "advertisement",
      "title": "Advertisement Cookies",
      "description": "Advertisement cookies are used to deliver relevant ads and marketing campaigns to you. They track visitors across websites and collect information to provide customized ads. These cookies will be set only if you give your consent.",
      "isMandatory": false,
      "cookies": []
    }
  ]
}
